<HTML> 
  <HEAD> 
	 <TITLE>Descartes - Dynamische Verkn&uuml;pfung</TITLE> 
  </HEAD> 
  <BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#ccffcc"> 
	 <H1 STYLE="font-size: x-large; font-weight: bold">Dynamische
		Verkn&uuml;pfung von Datendarstellungen</H1> 
	 <P>Descartes erm&ouml;glicht es mehrere Darstellung mit unterschiedlichen
		Attributen der selben Informationsmenge, oder gar des selben Attributes in
		unterschiedlicher Darstellungsweise zu erzeugen. Demnach kann der Benutzer eine
		oder mehrere Karten und verschiedene Diagramme wie dot
		plots (Punktgraphen), scatter plots ("Scatter"-Graphen), oder parallel coordinate
		plots (Graphen mit parallelen Koordinaten) gleichzeitig ge&ouml;ffnet haben.
		Alle diese Darstellungen sind dynamisch verbunden. D.h. wenn der Benutzer mit
		der Maus auf ein Objekt in einen der Darstellungen zeigt, werden alle
		graphischen Elemente des zugeh&ouml;rigen Objektes in s&auml;mtlichen
		Darstellungen (Konturen in der Karte, Punkte in den Graphen, Linien in dem
		Graphen mit parallelen Koordinaten) simultan hervorgehoben. </P> 
	 <P>Das Descartes System unterst&uuml;tzt zwei Arten von Markierungen:
		vor&uuml;bergehende und dauerhafte. Vor&uuml;bergehende ("mouse-over")
		Markierungen treten auf, wenn der Mauszeiger auf einem Objekt positioniert wird
		und verschwindet sofort wieder, wenn die Maus weg bewegt wird. Dauerhafte
		Markierungen treten auf, wenn ein Objekt durch Mausklick oder durch Mausziehen
		ausgew&auml;hlt wird und verschwindet erst wieder wenn der Benutzer es
		ausdr&uuml;cklich abw&auml;hlt. Ein Mausklick auf ein markiertes Objekt
		l&ouml;scht die Markierung. Ein Mausklick auf eine objektfreie Fl&auml;che in
		jeder Darstellung l&ouml;scht die Markierungen aller Objekte. Descartes
		verwendet wei&szlig; f&uuml;r die vor&uuml;bergehende Markierung und schwarz
		f&uuml;r die dauerhafte.</P> 
	 <P><U>Wichtige Hinweise</U>: </P> 
	 <UL> 
		<LI>Die Auswahl von dauerhafter Markierung durch Mausklick ist
		  standardm&auml;&szlig;ig eingeschaltet. Ein Benutzer m&ouml;chte vielleicht
		  einige Kartenmanipulationswerkzeuge auf Mausklick verwenden. Wenn diese Option
		  ausgew&auml;hlt ist, hat sie Priorit&auml;t und ein Mausklick wird nicht mehr
		  zum markieren benutzt. Der Benutzer kann dies auch wieder r&uuml;ckg&auml;ngig
		  machen, indem die entsprechende Option in dem Manipulationsfenster gew&auml;hlt
		  wird. </LI> 
		<LI>Die Auswahl durch Mausziehen ist standardm&auml;&szlig;ig in allen
		  Diagrammen erm&ouml;glicht. In einem Kartenfenster kann das Mausziehen sowohl zum Vergr&ouml;&szlig;ern als auch zum Verschieben
		  des Kartenausschnitts benutzt werden. Der Benutzer kann zwischen diesen
		  verschiedenen Interpretationen des Mausziehens in der Werkzeugleiste des
		  Kartenfensters hin und her schalten. </LI> 
		<LI>In einer Karte mit mehreren Schichten k&ouml;nnen nur Objekte der
		  aktiven Schicht markiert werden. Um eine Schicht zu aktivieren, klickt man
		  darauf in der Legende. Wenn die aktiven Schichten wechseln, werden markierte
		  Objekte der vorher aktiven Schicht entfernt. Sie erscheinen wieder, wenn
		  diese Schicht wieder aktiviert wird. </LI>
	 </UL> 
	 <P>Zum Beispiel wenn eine Karte und ein "Scatter"-Graph auf dem Bildschirm
		sind, kann ein Analytiker die interessanten Punkte in dem "Scatter"-Graph
		markieren und sie auf der Karte lokalisieren. Ebenso kann ein Analytiker ein
		Objekt auf der Karte markieren und die Position im Vergleich zu anderen
		Objekten im "Scatter"-Graphen analysieren.</P> 
	 <P><A HREF="Inhalt.htm" STYLE="font-size: large">Zur&uuml;ck zum
		Inhalt</A></P> </BODY>
</HTML>
