<!DOCTYPE HTML PUBLIC "-//SoftQuad Software//DTD HoTMetaL PRO 6.0::19990601::extensions to HTML 4.0//EN" "hmpro6.dtd">
<HTML> 
  <HEAD> 
	 <TITLE>Descartes - Einleitung</TITLE> 
  </HEAD> 
  <BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#ccffcc"> 
	 <P
	  STYLE="font-weight: bold; font-size: x-large; text-decoration: underline">Einleitung</P>
	 
	 <P STYLE="font-weight: bold">&Uuml;ber:</P> 
	 <P>Descartes XXI (fr&uuml;her IRIS)<BR> Intelligent System for Spatio-
		Temporal Exploratory Data Analysis<BR> Version 2.016, 27/06/2001<BR> (c)
		Anrienko 1995-2001, GMD 1992-1001<BR> e-mail gennady.andrienko@gmd.de <BR>
		http://borneo.gmd.de/and/</P> 
	 <P>Die Entwicklung des Systems wurde teilweise unterst&uuml;tzt<BR> von
		EU-funded projects <BR> CommonGIS (ESPRIT project 28983, 2000-2002) <BR> URLs
		http://commongis.jrc.it/ <BR> und http://www.ccg.leeds.ac.uk/spin/<BR> Java
		version 1.3.1, Windows NT, ver 4.0</P> 
	 <P>Das System enth&auml;lt Teile von Software, die von anderen eingebaut
		wurde:<BR> 1. Dateimanagement Dienstprogramme von IITP RAS,
		http://www.iitp.ru/<BR> 2. Implementierung des Open GIS simple feature
		specification von der Universit&auml;t Bonn
		http://www.guib.uni-bonn.de/exse/results/welcom.html<BR> 3. Kartendruck von
		Dialogis GmbH, http://www.dialogis.de</P> 
	 <P STYLE="font-weight: bold">Beschreibung:</P> 
	 <P>Descartes, ein Java basiertes und im Web nutzbares GIS (Geographisches
		Informations System), das in besonderer Weise die Erstellung und interaktive
		Analyse von thematischen Karten unterst&uuml;tzt. Aus einer Menge raumbezogener
		statistischer Gr&ouml;&szlig;en braucht sich der Benutzer nur die ihn
		interessierenden ausw&auml;hlen, und Descartes erstellt unter Anwendung einer
		kartographischen Wissensbasis automatisch eine Menge von Karten, in der die
		Gr&ouml;&szlig;en und ihre Beziehungen visuell erfa&szlig;t werden
		k&ouml;nnen.</P> 
	 <P>Es ist ein umgebungsunabh&auml;ngiges Programm. Seine
		umgebungsspezifischen Installationen hei&szlig;en Applikationen. Vom System aus
		gesehen ist eine Applikation eine Reihe von Informationsdateien, die zusammen
		mit Bedienungsdateien, welche dem System mitteilen wie die Daten handzuhaben
		sind, visualisiert und analysiert werden.<BR> Eine Applikation sollte zwei
		Arten von Informationsdateien erhalten:<BR> &amp;middot; Tabellen mit
		Attributdaten welche r&auml;umlichen Objekten (Bezirke, St&auml;dte, Regionen,
		etc.) zugeordnet sind. Die Objekte werden &uuml;ber ihre Bezeichner aus
		Tabellen heraus benannt. Eine Tabelle sollte eine Zeile mit Objektbezeichner
		haben.<BR> &amp;middot; geographische Schichten, d.h. Dateien, welche Punkte,
		Linien oder Fl&auml;chen (Polygone) in Vektorformat enthalten. Jeder Tabelle
		sollte eine geographische Schicht zugeordnet werden, welche die r&auml;umlichen
		Objekte dieser enth&auml;lt. Diese Objekte sollten in der Tabelle und in der
		geographischen Schicht die selben Bezeichner haben.<BR> Eine Applikation kann
		einige Tabellen enthalten, die der selben geographischen Schicht zugeordnet
		sind, als auch unterschiedlichen Schichten. Jedoch kann eine Tabelle nicht auf
		mehrere Schichten zugleich zugeordnet sein. In einer Applikation k&ouml;nnen
		beliebig viele Schichten vorkommen. Die Schichten, die keine Objekte einer
		Tabelle enthalten, k&ouml;nnten als geographischer Hintergrund der
		Pr&auml;sentation dienen. Welche Schichten in einer Applikation vorhanden sind,
		wird in der Legende der Karte dargestellt.</P> 
	 <P>Descartes erm&ouml;glicht es mehrere Darstellung mit unterschiedlichen
		Attributen der selben Informationsmenge, oder gar des selben Attributes in
		unterschiedlicher Darstellungsweise zu erzeugen. Demnach kann der Benutzer eine
		oder mehrere Karten und verschiedene nicht graphische Darstellungen wie dot
		plots (Punktgraphen), scatter plots (Streugraphen), oder parallel coordinate
		plots (Graphen mit parallelen Koordinaten) gleichzeitig ge&ouml;ffnet haben.
		Alle diese Darstellungen sind dynamisch verbunden. D.h. wenn der Benutzer mit
		der Maus auf ein Objekt in einen der Darstellungen zeigt, werden alle
		graphischen Elemente des zugeh&ouml;rigen Objektes in s&auml;mtlichen
		Darstellungen (Konturen in der Karte, Punkte in den Graphen, Linien in dem
		Graphen mit parallelen Koordinaten) simultan hervorgehoben. Mehr Informationen
		zu dynamische Verkn&uuml;pfungen kann man <A
		HREF="DynamischeVerknuepfung.htm">hier</A> finden.</P> 
	 <P><A HREF="Inhalt.htm" STYLE="font-size: x-large">Zur&uuml;ck zum
		Inhalt</A></P> </BODY>
</HTML>
