<HTML> 
  <HEAD> 
	 <TITLE>Descartes - Kalkulation als Entscheidungshilfe</TITLE> 
  </HEAD> 
  <BODY BGCOLOR="#CCFFCC"> 
	 <P><A NAME="DS0" STYLE="font-weight: bold; font-size: x-large">Kalkulation
		als Entscheidungshilfe</A></P> 
	 <P><A HREF="#DS1">Integrierte Kriterien</A><BR><A HREF="#DS2">Werte -&gt;
		Reihenfolge</A></P> 
	 <P ALIGN="LEFT">Siehe auch <A
		HREF="Entscheidungshilfe.htm">Entscheidungshilfe</A>.</P> 
	 <P><A HREF="Inhalt.htm" STYLE="font-size: large">Zur&uuml;ck zum
		Inhalt</A></P> 
	 <P><A NAME="DS1"
		STYLE="font-weight: bold; font-size: large; text-decoration: underline">Integrierte
		Kriterien</A></P> 
	 <P>Eine weitere Anwendung von Graphen mit parallelen Koordinaten ist die
		Auswerteung von Objekten auf der Basis des "multiple criteria". Es gibt eine
		Reihe von Berechnungsmethoden, welche dieses unterst&uuml;tzen. Bei einer davon
		wird die relative Wichtigkeit eines Kriteriums durch Gewichte ausgedr&uuml;ckt.
		F&uuml;r jedes Objekt wird ein integriertes Ergebnis berechnet, welches die
		Gewichte der Kriterien mit einbezieht. Die zwei Typen der Kriterien m&uuml;ssen
		unterschieden werden: Profit Kriterien (h&ouml;here Werte sind besser) und
		Kostenkriterien (niedrigere Werte sind besser). <BR>Bewertungsergebnisse
		k&ouml;nnen mit dem Graphen mit parallelen Koordinaten untersucht werden. Jedes
		Kriterium, sowie das integrierte Ergebnis, werden auf separaten Achsen
		dargestellt (siehe Abb. 1). Die Achsen f&uuml;r Profitkriterien werden von
		links nach rechts orientiert und die Achsen f&uuml;r Kostenkriterien
		andersherum. Die L&auml;nge der Achsen k&ouml;nnen proportional zu den Gewichen
		der Kriterien gemacht werden (optional).<BR>Solch eine Darstellung erleichtert
		das Verst&auml;ndnis und die Pr&uuml;fung der Ergebnisse der automatischen
		Bewertung. Mit dieser Konstruktion der Achsen sind diejenigen Objekte besser,
		deren Linien weiter rechts sind. Die Position auf der Ergebnisachse wird somit
		auch weiter rechts sein. <BR>Die Visualisierung erlaubt eine interaktive
		Analyse der Empfindlichkeit der Bewertungsergebnisse bez&uuml;glich
		Ver&auml;nderungen der Gewichtungen. Wenn irgendein Gewicht ver&auml;ndert wird,
		wird das Ergebnis sofort neu berechnet und in dem "parallel coordinates plot"
		dargestellt.</P> 
	 <P ALIGN="CENTER"><IMG SRC="CalculationDecisionSupport4.gif" WIDTH="629"
		HEIGHT="400" BORDER="0" ALT="1"><BR>Abb. 1<BR>Parallel coordinate plot f&uuml;r
		Entscheidungshilfe</P> 
	 <P>Die Darstellung kann mit einer Karte verbunden werden, welche die
		Objekte anzeigt. In Abb. 2 wurde der Graph mit parallelen Koordinaten mit einer Karte
		verbunden, die das Bewertungsergebnis in Farbschattierungen darstellt. Die
		Linien und Konturen der besten Optionen sind in der Karte und dem Graphen
		hervorgehoben. Die Karte kann die endg&uuml;ltigen Ergebnisse z.B. durch
		zeichnen, darstellen und sie gleichzeitig mit Ver&auml;nderungen des Graphen &auml;ndern.</P> 
	 <P ALIGN="CENTER"><IMG SRC="CalculationDecisionSupport5.gif" WIDTH="569"
		HEIGHT="412" BORDER="0" ALT="2"><BR>Abb. 2<BR>Visualisierung der
		Entscheidungshilfe durch die Rangfolge in Farbschattierungen</P> 
	 <P>Das K&auml;stchen "classify results" in der unteren linken Ecke der
		Darstellung &uuml;bertr&auml;gt eine Klassifikation der Rangfolge auf die Karte
		(siehe Abb. 3). Klassifikation wird <A HREF="Karten.htm#M4">hier</A> n&auml;her
		erkl&auml;rt.</P> 
	 <P ALIGN="CENTER"><IMG SRC="CalculationDecisionSupportClassification.gif"
		WIDTH="545" HEIGHT="408" BORDER="0" ALT="3"><BR>Abb. 3<BR>Visualisierung der
		klassifizierten Entscheidungshilfe</P> 
	 <P></P> 
	 <P><A HREF="#DS0" STYLE="font-size: medium">Zur&uuml;ck zum Anfang</A></P> 
	 <P><A NAME="DS2"
		STYLE="font-weight: bold; font-size: large; text-decoration: underline">Werte
		-&gt; Reihenfolge</A></P> 
	 <P>Mit dieser Kalkulationsmethode werden alle Werte des ausgew&auml;hlten
		Attributs geordnet. Eine Reihenfolge der Objekte wird auf der Karte in
		Farbschattierungen dargestellt (siehe Abb. 4).</P> 
	 <P ALIGN="CENTER"><IMG
		SRC="CalculationDecisionSupportOderValues.gif" WIDTH="604" HEIGHT="412"
		BORDER="0" ALT="4"><BR>Abb. 4<BR>Visualisierung der Reihenfolge der Werte in
		Farbschattierungen</P> 
	 <P>Ein weiteres Beispiel ist die Geburtenrate (Promille) von Provinzen in
		Portugal. Abbildung 5 zeigt die Werte der Provinzen:</P> 
	 <P ALIGN="CENTER"><IMG SRC="OderValue.gif" WIDTH="191" HEIGHT="254"
		BORDER="0" ALT="5"><BR>Figure 5<BR>Portugal - Werte der Geburtenrate (Promille)
		in den Provinzen</P> 
	 <P>Ein neues Attribut (Reihenfolge der Objekte) wird der Tabelle
		hinzugef&uuml;gt und auf der Karte in Farbschattierungen dargestellt
		(Abb.6).</P> 
	 <P ALIGN="CENTER"><IMG SRC="OderedValue.gif" WIDTH="640" HEIGHT="499"
		BORDER="0" ALT="6"><BR>Abb. 6<BR>Portugal - Reihenfolge der Geburtenrate (promille)</P> 
	 <P></P> 
	 <P><A HREF="#DS0" STYLE="font-size: medium">Zur&uuml;ck zum Anfang</A></P> 
	 <P STYLE="font-size: large"><A HREF="Inhalt.htm"
		STYLE="font-size: large">Zur&uuml;ck zum Inhalt</A></P> </BODY>
</HTML>
